; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=6, locations=10, density=0.5333333333333333, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=13, seed=54

(define (problem transport-13)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l7)
    (at p3 l4)
    (at p4 l8)
    (at p5 l6)
    (at p6 l10)
    (at v1 l7)
    (at v2 l4)
    (at v3 l4)
    (at v4 l1)
    (road l2 l7)
    (road l4 l10)
    (road l5 l1)
    (road l2 l6)
    (road l10 l8)
    (road l10 l4)
    (road l6 l1)
    (road l7 l9)
    (road l8 l10)
    (road l1 l5)
    (road l6 l2)
    (road l1 l6)
    (road l4 l3)
    (road l4 l2)
    (road l3 l4)
    (road l2 l4)
    (road l7 l2)
    (road l9 l7)
    (road l2 l10)
    (road l10 l2)
    (road l6 l10)
    (road l10 l6)
    (road l1 l3)
    (road l3 l1)
    (road l8 l9)
    (road l9 l8)
    (road l4 l5)
    (road l5 l4)
    (road l9 l10)
    (road l10 l9)
    (road l4 l7)
    (road l7 l4)
    (road l3 l9)
    (road l9 l3)
    (road l2 l5)
    (road l5 l2)
    (road l3 l8)
    (road l8 l3)
    (road l3 l6)
    (road l6 l3)
    (road l4 l8)
    (road l8 l4)
    (road l2 l8)
    (road l8 l2)
    (road l2 l9)
    (road l9 l2)
    (road l1 l7)
    (road l7 l1)
    )
 (:goal  (and 
    (at p1 l6)
    (at p2 l9)
    (at p3 l1)
    (at p4 l5)
    (at p5 l4)
    (at p6 l6))))

; plan
1. (drive v3 l4 l3)
   deleted: (at v3 l4)
   added: (at v3 l3)
   goals met: 0 of 6
2. (drive v2 l4 l10)
   deleted: (at v2 l4)
   added: (at v2 l10)
   goals met: 0 of 6
3. (pick-up v2 l10 p6 c1 c2)
   deleted: (at p6 l10) (capacity v2 c2)
   added: (in p6 v2) (capacity v2 c1)
   goals met: 0 of 6
4. (pick-up v1 l7 p2 c0 c1)
   deleted: (at p2 l7) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 0 of 6
5. (drive v1 l7 l9)
   deleted: (at v1 l7)
   added: (at v1 l9)
   goals met: 0 of 6
6. (drive v2 l10 l8)
   deleted: (at v2 l10)
   added: (at v2 l8)
   goals met: 0 of 6
7. (drop v1 l9 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l9) (capacity v1 c1)
   goals met: 1 of 6
8. (pick-up v2 l8 p1 c0 c1)
   deleted: (at p1 l8) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 1 of 6
9. (drive v3 l3 l6)
   deleted: (at v3 l3)
   added: (at v3 l6)
   goals met: 1 of 6
10. (pick-up v3 l6 p5 c1 c2)
   deleted: (at p5 l6) (capacity v3 c2)
   added: (in p5 v3) (capacity v3 c1)
   goals met: 1 of 6
11. (drive v3 l6 l1)
   deleted: (at v3 l6)
   added: (at v3 l1)
   goals met: 1 of 6
12. (drive v2 l8 l3)
   deleted: (at v2 l8)
   added: (at v2 l3)
   goals met: 1 of 6
13. (drive v2 l3 l6)
   deleted: (at v2 l3)
   added: (at v2 l6)
   goals met: 1 of 6
14. (drop v2 l6 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l6) (capacity v2 c1)
   goals met: 2 of 6
15. (drop v2 l6 p6 c1 c2)
   deleted: (in p6 v2) (capacity v2 c1)
   added: (at p6 l6) (capacity v2 c2)
   goals met: 3 of 6
16. (drive v1 l9 l8)
   deleted: (at v1 l9)
   added: (at v1 l8)
   goals met: 3 of 6
17. (pick-up v1 l8 p4 c0 c1)
   deleted: (at p4 l8) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 6
18. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 3 of 6
19. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 3 of 6
20. (drop v1 l5 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l5) (capacity v1 c1)
   goals met: 4 of 6
21. (drive v3 l1 l7)
   deleted: (at v3 l1)
   added: (at v3 l7)
   goals met: 4 of 6
22. (drive v3 l7 l4)
   deleted: (at v3 l7)
   added: (at v3 l4)
   goals met: 4 of 6
23. (drop v3 l4 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l4) (capacity v3 c2)
   goals met: 5 of 6
24. (drive v1 l5 l4)
   deleted: (at v1 l5)
   added: (at v1 l4)
   goals met: 5 of 6
25. (pick-up v1 l4 p3 c0 c1)
   deleted: (at p3 l4) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 5 of 6
26. (drive v1 l4 l7)
   deleted: (at v1 l4)
   added: (at v1 l7)
   goals met: 5 of 6
27. (drive v1 l7 l1)
   deleted: (at v1 l7)
   added: (at v1 l1)
   goals met: 5 of 6
28. (drop v1 l1 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l1) (capacity v1 c1)
   goals met: 6 of 6
